results/node/uws.txt
Bundle: 3.0 KB
Startup: 51.4 ms
Memory before: 68.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    131248.87    7582.01  154463.75
  Latency        3.81ms   333.11us    26.12ms
  HTTP codes:
    1xx - 0, 2xx - 1310956, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.75MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    132219.17    8584.47  160694.75
  Latency        3.78ms   451.45us    46.48ms
  HTTP codes:
    1xx - 0, 2xx - 1317825, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    31.66MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     79833.95    7476.56   96901.86
  Latency        6.27ms     0.87ms    59.55ms
  HTTP codes:
    1xx - 0, 2xx - 795194, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.68MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       153.57      88.92     400.19
  Latency       64.80ms     6.96ms   114.79ms
  HTTP codes:
    1xx - 0, 2xx - 1545, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.03GB/s

Memory after: 137.3 MB